Revit 2026 API

# ZoneEquipmentData Properties

---

The ZoneEquipmentData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AirSystemId | The air system used for this zone equipment, if applicable. |
|  | ChilledWaterLoopId | The chilled water loop used for the chilled water option of cooling coil. |
|  | CondenserWaterLoopId | The condenser water loop used for the direction expansion water cooled option of cooling coil. |
|  | CoolingCoilType | The type of cooling coil. Note this property change would reset the chilled water loop. |
|  | EquipmentBehavior | The behavior of how zone equipment is allocated with assigned spaces. |
|  | EquipmentType | The type of zone equipment. Note this property would reset other properties. |
|  | HeatingCoilType | The type of heating coil. Note this property change would reset the hot water loop. |
|  | HotWaterLoopId | The water loop element id for the hot-water heating coil. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | VRFLoopId | The Varible Refrigerant Flow loop for the VRF fan coil equipment type. |

#### Reference

ZoneEquipmentData Class

Autodesk.Revit.DB.Mechanical Namespace